#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
random_id.bucket_id: Refreshing state... [id=1NQhVYR7gkQ]
data.google_client_config.provider: Reading...
google_storage_bucket.tf_state_bucket: Refreshing state... [id=terraform-state-d4d42155847b8244]
google_container_cluster.prod_cluster: Refreshing state... [id=projects/hackathon-climat-05/locations/europe-west1/clusters/prod-cluster]
data.google_client_config.provider: Read complete after 0s [id=projects/hackathon-climat-05/regions//zones/]
module.prod_apps.kubernetes_namespace.namespace: Refreshing state... [id=greenmile-prod]
module.stg_apps.kubernetes_namespace.namespace: Refreshing state... [id=greenmile-stg]
module.prod_apps.kubernetes_deployment.auth_microservice: Refreshing state... [id=greenmile-prod/auth-microservice]
module.stg_apps.kubernetes_deployment.app_front: Refreshing state... [id=greenmile-stg/app-front]
module.prod_apps.kubernetes_deployment.app_front: Refreshing state... [id=greenmile-prod/app-front]
module.stg_apps.kubernetes_deployment.auth_microservice: Refreshing state... [id=greenmile-stg/auth-microservice]
module.stg_apps.kubernetes_service.front: Refreshing state... [id=greenmile-stg/front]
module.stg_apps.kubernetes_horizontal_pod_autoscaler.front_autoscaler: Refreshing state... [id=greenmile-stg/front-autoscaler]
module.prod_apps.kubernetes_horizontal_pod_autoscaler.front_autoscaler: Refreshing state... [id=greenmile-prod/front-autoscaler]
module.prod_apps.kubernetes_service.front: Refreshing state... [id=greenmile-prod/front]
module.prod_apps.kubernetes_horizontal_pod_autoscaler.auth_autoscaler: Refreshing state... [id=greenmile-prod/auth-autoscaler]
module.prod_apps.kubernetes_service.auth: Refreshing state... [id=greenmile-prod/auth]
module.stg_apps.kubernetes_horizontal_pod_autoscaler.auth_autoscaler: Refreshing state... [id=greenmile-stg/auth-autoscaler]
module.stg_apps.kubernetes_service.auth: Refreshing state... [id=greenmile-stg/auth]
module.prod_apps.kubernetes_ingress_v1.app_ingress: Refreshing state... [id=greenmile-prod/app-ingress]
module.stg_apps.kubernetes_ingress_v1.app_ingress: Refreshing state... [id=greenmile-stg/app-ingress]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.prod_apps.google_compute_global_address.static_ip will be created
  + resource "google_compute_global_address" "static_ip" {
      + address            = (known after apply)
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "greenmile-front-prod"
      + project            = (known after apply)
      + self_link          = (known after apply)
    }

  # module.prod_apps.kubernetes_ingress_v1.app_ingress will be updated in-place
  ~ resource "kubernetes_ingress_v1" "app_ingress" {
        id     = "greenmile-prod/app-ingress"
        # (1 unchanged attribute hidden)

      ~ metadata {
          ~ annotations      = {
              + "kubernetes.io/ingress.global-static-ip-name" = "greenmile-front-prod"
              + "networking.gke.io/managed-certificates"      = "app-ssl-certificate"
                # (1 unchanged element hidden)
            }
            name             = "app-ingress"
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.prod_apps.kubernetes_manifest.app_ssl_certificate will be created
  + resource "kubernetes_manifest" "app_ssl_certificate" {
      + manifest = {
          + apiVersion = "networking.gke.io/v1"
          + kind       = "ManagedCertificate"
          + metadata   = {
              + name      = "app-ssl-certificate"
              + namespace = "greenmile-prod"
            }
          + spec       = {
              + domains = [
                  + "greenmile.app",
                  + "greenmile.earth",
                  + "greenmile.cloud",
                ]
            }
        }
      + object   = {
          + apiVersion = "networking.gke.io/v1"
          + kind       = "ManagedCertificate"
          + metadata   = {
              + annotations                = (known after apply)
              + clusterName                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
              + name                       = "app-ssl-certificate"
              + namespace                  = "greenmile-prod"
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
          + spec       = {
              + domains = [
                  + "greenmile.app",
                  + "greenmile.earth",
                  + "greenmile.cloud",
                ]
            }
        }
    }

  # module.stg_apps.google_compute_global_address.static_ip will be created
  + resource "google_compute_global_address" "static_ip" {
      + address            = (known after apply)
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "greenmile-front-stg"
      + project            = (known after apply)
      + self_link          = (known after apply)
    }

  # module.stg_apps.kubernetes_ingress_v1.app_ingress will be updated in-place
  ~ resource "kubernetes_ingress_v1" "app_ingress" {
        id     = "greenmile-stg/app-ingress"
        # (1 unchanged attribute hidden)

      ~ metadata {
          ~ annotations      = {
              + "kubernetes.io/ingress.global-static-ip-name" = "greenmile-front-stg"
              + "networking.gke.io/managed-certificates"      = "app-ssl-certificate"
                # (1 unchanged element hidden)
            }
            name             = "app-ingress"
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.stg_apps.kubernetes_manifest.app_ssl_certificate will be created
  + resource "kubernetes_manifest" "app_ssl_certificate" {
      + manifest = {
          + apiVersion = "networking.gke.io/v1"
          + kind       = "ManagedCertificate"
          + metadata   = {
              + name      = "app-ssl-certificate"
              + namespace = "greenmile-stg"
            }
          + spec       = {
              + domains = [
                  + "stg.greenmile.app",
                  + "stg.greenmile.earth",
                  + "stg.greenmile.cloud",
                ]
            }
        }
      + object   = {
          + apiVersion = "networking.gke.io/v1"
          + kind       = "ManagedCertificate"
          + metadata   = {
              + annotations                = (known after apply)
              + clusterName                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
              + name                       = "app-ssl-certificate"
              + namespace                  = "greenmile-stg"
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
          + spec       = {
              + domains = [
                  + "stg.greenmile.app",
                  + "stg.greenmile.earth",
                  + "stg.greenmile.cloud",
                ]
            }
        }
    }

Plan: 4 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pushed by: @au2001, Action: `pull_request`*